Revit 2026 API

# PrimarySizeCriterion Class

---

This class contains a size criterion for a RoutingPreferenceRule.

SystemObject Autodesk.Revit.DBRoutingCriterionBase Autodesk.Revit.DBPrimarySizeCriterion

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrimarySizeCriterion : RoutingCriterionBase
```
```vb
Public Class PrimarySizeCriterion
	Inherits RoutingCriterionBase
```
```cpp
public ref class PrimarySizeCriterion : public RoutingCriterionBase
```
```fsharp
type PrimarySizeCriterion =
    class
        inherit RoutingCriterionBase
    end
```

The PrimarySizeCriterion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrimarySizeCriterion | Constructs a PrimarySizeCriterion with a minimum and maximum size. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RoutingCriterionBase) |
|  | MaximumSize | The maximum size of this criterion. |
|  | MinimumSize | The minimum size of this criterion. |

|  | Name | Description |
| --- | --- | --- |
|  | All | Creates a criterion with a range of all sizes. |
|  | Dispose | (Inherited from RoutingCriterionBase) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Verify if two criteria are the same. (Inherited from RoutingCriterionBase) |
|  | None | Creates a criterion with a range of no sizes. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace